Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--geotools_overview.tmx
Source language: en
Languages: ja

source: GeoTools is an open source (LGPL) Java library which provides standards compliant methods for manipulating geospatial data, and uses data structures based on Open Geospatial Consortium (OGC) specifications.
ja: GeoTools は Open Geospatial Consortium (OGC) の標準に準拠した空間データの操作やデータ構造を利用するための、オープンソース (LGPL) の Java ライブラリです。

source: GeoTools is used by a number of projects including web services, command line tools and desktop applications. OSGeoLive applications which include GeoTools include: :doc:`52nSOS_overview`, :doc:`52nWPS_overview`, AtlasStyler, :doc:`geomajas_overview`, Geopublisher, :doc:`geoserver_overview`, and :doc:`udig_overview`.
ja: GeoTools は Web サービスやコマンドライン、デスクトップアプリケーションなどを含むいくつかのプロジェクトで利用されています。OSGeoLive のアプリケーションで GeoTools を利用しているものは以下となります: :doc:`52nSOS_overview`, :doc:`52nWPS_overview`, AtlasStyler, :doc:`geomajas_overview`, Geopublisher, :doc:`geoserver_overview`, 及び :doc:`udig_overview`

source: Core Features
ja: 主要機能

source: Definition of interfaces for key spatial concepts and data structures
ja: 主要な空間概念とデータ構造のためのインタフェースの定義

source: Integrated Geometry support provided by `JTS Topology Suite (JTS) <https://sourceforge.net/projects/jts-topo-suite/>`_
ja: 統合されたジオメトリのサポートは、`JTS Topology Suite(JTS)<https://sourceforge.net/projects/jts-topo-suite/>`_によって提供されます。

source: Attribute and spatial filters using OGC Filter Encoding specification
ja: OGC Filter Encoding仕様を使用する属性および空間フィルタ

source: A clean data access API supporting feature access, transaction support and locking between threads
ja: スレッド間、トランザクションサポート、スレッド間のロックをサポートするクリーンなデータアクセスAPI

source: Access GIS data in many file formats and spatial databases
ja: 多くのファイル形式および空間データベースのGISデータにアクセスする

source: Coordinate reference system and transformation support
ja: 座標参照系と変換サポート

source: Work with an extensive range of map projections
ja: 広範囲のマップ投影を使用する

source: filter and analyze data in terms of spatial and non-spatial attributes
ja: 空間的および非空間的属性に関してデータをフィルタ処理および分析する

source: A stateless, low memory renderer, particularly useful in server-side environments.
ja: ステートレスでメモリの少ないレンダラ。サーバ側の環境で特に便利です。

source: compose and display maps with complex styling
ja: 複雑なスタイルを使用してマップを作成および表示する

source: Powerful *schema assisted* parsing technology using XML Schema to bind to GML content
ja: XML Schemaを使用してGMLコンテンツにバインドする強力な*schema assisted*解析テクノロジ

source: The parsing / encoding technology is provided with bindings for many OGC standards including GML, Filter, KML, SLD, and SE.
ja: 構文解析/符号化技術は、GML、Filter、KML、SLD、およびSEを含む多くのOGC標準のバインディングを備えています。

source: GeoTools Plugins: open plug-in system allowing you to teach the library additional formats
ja: GeoToolsプラグイン:ライブラリに追加のフォーマットを追加ができるオープンなプラグインシステム

source: Plug-ins for the ImageIO-EXT project allowing GeoTools to read additional raster formats from GDAL
ja: GDALから追加のラスター形式を読み込めるようにするImageIO-EXTプロジェクトのプラグイン

source: GeoTools Extensions
ja: GeoTools拡張機能

source: Provide additional capabilities built using the spatial facilites of the core library.
ja: コアライブラリのspatial facilitesを使用して構築された追加機能を提供します。

source: Extensions provide graph and networking support (for finding the shortest path), validation, a web map server client, bindings for xml parsing and encoding and color brewer.
ja: 拡張機能は、(最短パスを見つけるための)グラフとネットワーキングのサポート、検証、Webマップサーバクライアント、XML構文解析とエンコーディングのバインディング、そしてカラーbrewerを提供します。

source: GeoTools Unsupported
ja: サポートされていないGeoTools

source: GeoTools also operates as part of a wider community with a staging area used to foster new talent and promote experimentation.
ja: GeoToolsはまた、新しい人材を育成し、実験を促進するために使用されるステージング領域を持つ、より広いコミュニティの一部として動作します。

source: Some highlights are swing support (used in geotools tutorials), swt, local and web process support, additional symbology, additional data formats, generation of grids and a couple of implementations of ISO Geometry.
ja: 注目すべき点は、スイングサポート(geotoolsチュートリアルで使用)、swt、ローカルおよびWebプロセスサポート、追加の記号、追加のデータフォーマット、グリッドの生成、およびISOジオメトリのいくつかの実装です。

source: Supported Formats
ja: サポートするフォーマット

source: raster formats and data access:
ja: ラスター形式とデータアクセス:

source: Database "jdbc-ng" support:
ja: データベース "jdbc-ng"のサポート:

source: Vector formats and data access:
ja: ベクタフォーマットとデータアクセス:

source: XML Bindings:
ja: XML バインディング:

source: Java data structures and bindings provided for the following: xsd-core (xml simple types), fes, filter, gml2, gml3, kml, ows, sld, wcs, wfs, wms, wps, vpf.
ja: 次データのために提供されるJavaデータ構造とバインディング: xsd-core (xml simple types), fes, filter, gml2, gml3, kml, ows, sld, wcs, wfs, wms, wps, vpf.

source: Additional Geometry, Filter and Style parser/encoders available for DOM and SAX applications.
ja: DOMおよびSAXサプリケーションで利用できる追加のジオメトリ、フィルタ、スタイルのパーサ/エンコーダ。

source: Implemented Standards
ja: 実装されている標準規格

source: Support of numerous Open Geospatial Consortium (OGC) standards:
ja: 多数のオープン地理空間コンソーシアム(OGC)標準のサポート:

source: OGC Style Layer Descriptor / Symbology Encoding data structures and rendering engine
ja: OGC Style Layer Descriptor/記号データ構造のエンコードとレンダリングエンジン

source: OGC General Feature Model including Simple Feature support
ja: Simple Featureサポートを含むOGC General Feature Model

source: OGC Grid Coverage representation of raster information
ja: ラスタ情報表現のOGC Grid Coverage

source: OGC Filter and Common Constraint Language (CQL)
ja: OGC Filterと Common Constraint Language (CQL)

source: Clients for Web Feature Service (WFS), Web Map Service (WMS) and experimental support for Web Process Service (WPS)
ja: Web Feature Service(WFS)、Web Map Service(WMS)、およびWeb Process Service(WPS)の試験的サポートのクライアント

source: ISO 19107 Geometry
ja: ISO19107ジオメトリ

source: Details
ja: 詳細

source: **Website:** https://geotools.org/
ja: **Webサイト:** https://geotools.org/

source: **Licence:** LGPL
ja: **ライセンス:** LGPL

source: **Supported Platforms:** Cross Platform Java 8,9,10
ja: **対応OS:** Cross Platform Java 8,9,10

source: **API Interfaces:** Java
ja: **API インターフェイス:** Java

source: **Support:** `Communication and Support <http://docs.geotools.org/latest/userguide/welcome/support.html>`_
ja: **サポート:** `Communication and Support <http://docs.geotools.org/latest/userguide/welcome/support.html>`_

source: GeoTools_Support
ja: GeoTools_サポート

source: `Quickstart documentation <http://docs.geotools.org/latest/userguide/tutorial/quickstart/index.html>`_
ja: `クイックスタート文書 <http://docs.geotools.org/latest/userguide/tutorial/quickstart/index.html>`_
